app/views/sections/show.html.erb

      <% if (@section.lessons != nil) %>
         <% @section.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."section_id" = $1  [["section_id", 4]]