app/views/lessons/new.html.erb

    <% @chapters.each do |chapter| %>
      <% chapter.sections.each do |section| %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."chapter_id" = $1  [["chapter_id", 1]]