app/views/chapters/index.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."chapter_id" = $1  [["chapter_id", 1]]
---
    <% if chapter.sections != nil %>
	  <% chapter.sections.each do |section| %>

SELECT "lessons".* FROM "lessons" WHERE "lessons"."section_id" = $1  [["section_id", 4]]
---
	      <% if (section.lessons != nil) %>
	         <% section.lessons.each do |lesson| %>