app/controllers/chapters_controller.rb

  def index
    @chapters = Chapter.all
---
SELECT "chapters".* FROM "chapters"

  def create
    @chapters = Chapter.all
  	@chapter = Chapter.new(params[:chapter])
    if @chapter.save
---
INSERT INTO "chapters" ("number", "name") VALUES ($1, $2) RETURNING "id"  [["number", 1], ["name", "Epicness"]]

  def show
    @chapter = Chapter.find(params[:id])
---
SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = $1 LIMIT 1  [["id", 2]]

 def destroy
    @chapter = Chapter.find(params[:id])
    @chapter.destroy
---
SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "chapters" WHERE "chapters"."id" = $1  [["id", 2]]