app/controllers/lessons_controller.rb

  def new
    @section = Section.find(params[:section_id])
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT 1  [["id", nil]]

  def create
   @lesson = Lesson.new(:number => params[:number],
                        :name =>  params[:name],
                        :text => params[:text],
                        :section_id => params[:section_id])
   @section = Section.find(params[:section_id])
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT 1  [["id", 4]]