app/controllers/lessons_controller.rb

  def new
    @lesson = Lesson.new
    @chapters = Chapter.all
    @sections = Section.all
---
SELECT "chapters".* FROM "chapters"
SELECT "sections".* FROM "sections"

  def create
    @lesson = Lesson.new(params[:lesson])
    @chapters = Chapter.all
    @sections = Section.all
    if @lesson.save
---
SELECT "chapters".* FROM "chapters"
SELECT "sections".* FROM "sections"
INSERT INTO "lessons" ("number", "name", "text", "section_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["number", 2], ["name", "Movement"], ["text", "When you move, you live. Cool, huh?"], ["section_id", 5], ["created_at", "2015-01-15 21:19:16.244678"], ["updated_at", "2015-01-15 21:19:16.244678"]]

  def show
    @lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1  ORDER BY "lessons"."id" ASC LIMIT 1  [["id", 3]]

  def edit
    @lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", nil]]

  def update
    @lesson = Lesson.find(params[:id])
    if @lesson.update(:number => params[:number],
                      :name => params[:name],
                      :text => params[:text])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "lessons" SET "name" = $1, "text" = $2, "section_id" = $3, "updated_at" = $4 WHERE "lessons"."id" = $5  [["name", "Revised First Lesson"], ["text", "This is the revised first lesson. Good, right?"], ["section_id", nil], ["updated_at", "2015-01-15 21:48:29.863036"], ["id", 1]]

 def destroy
    @lesson = Lesson.find(params[:id])
    @lesson.destroy
---
DELETE FROM "lessons" WHERE "lessons"."id" = $1  [["id", 26]]