app/controllers/sections_controller.rb

  def new
    @chapters = Chapter.all
---
SELECT "chapters".* FROM "chapters"

  def create
   @section = Section.new(params[:section])
   @chapters = Chapter.all

    if @section.save
---
SELECT "chapters".* FROM "chapters"
INSERT INTO "sections" ("number", "name", "chapter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number", 3], ["name", "Start Dancing"], ["chapter_id", 4], ["created_at", "2015-01-15 19:17:09.477099"], ["updated_at", "2015-01-15 19:17:09.477099"]]

  def show
    @section = Section.find(params[:id])
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT 1  [["id", 1]]

 def destroy
    @section = Section.find(params[:id])
    @section.destroy
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "sections" WHERE "sections"."id" = $1  [["id", 5]]